Repository: bogdanbabych/0945BUT10201-lex2
Catalog: data/s01rawFiles/gnu-en--de-v03.tmx
Source language: en
Languages: de

source: It has technical advantages as well, such as supporting a variety of languages, not just C++.
de: Es hat auch technische Vorteile wie die Unterstützung einer Vielzahl von Programmiersprachen, nicht nur C++.

source: But its main purpose was freedom: not to require the use of any nonfree software.
de: Aber das wichtigste Ziel war Freiheit: keine unfreie Software erforderlich.

source: Harmony is a compatible replacement library, designed to make it possible to run KDE software without using Qt.
de: Harmony ist eine kompatible Ersatzbibliothek, entworfen, um zu ermöglichen, KDE-Software ohne Qt zu nutzen.

source: In November 1998, the developers of Qt announced a change of license which, when carried out, should make Qt free software.
de: Im November 1998 kündigten die Entwickler von Qt eine Änderung der Lizenz an, die, wenn in die Tat umgesetzt, Qt zu freier Software machen sollte.

source: There is no way to be sure, but I think that this was partly due to the community's firm response to the problem that Qt posed when it was nonfree. (The new license is inconvenient and inequitable, so it remains desirable to avoid using Qt.)
de: Es gibt keine Möglichkeit um sicher zu sein, aber ich denke, dass dies zum Teil durch die entschiedene Reaktion der Gemeinschaft auf das Problem, das Qt darstellte als es unfrei war, verursacht war (die neue Lizenz ist ungeeignet und ungerecht, so bleibt es wünschenswert, die Nutzung von Qt zu vermeiden).

source: [Subsequent note: in September 2000, Qt was rereleased under the GNU GPL, which essentially solved this problem.]
de: (Nachträgliche Anmerkung: Im September 2000 wurde Qt unter der GNU GPL neu freigegeben, was dieses Problem im Grunde löste.)

source: How will we respond to the next tempting nonfree library?
de: Wie antworten wir auf die nächste verlockende unfreie Bibliothek?

source: Will the whole community understand the need to stay out of the trap?
de: Versteht die gesamte Gemeinschaft die Notwendigkeit, nicht in die Falle zu tappen?

source: Or will many of us give up freedom for convenience, and produce a major problem?
de: Oder geben viele von uns Freiheit zugunsten Bequemlichkeit auf und erzeugen so ein größeres Problem?

source: Our future depends on our philosophy.
de: Unsere Zukunft hängt von unserer Philosophie ab.

source: Software patents The worst threat we face comes from software patents, which can put algorithms and features off limits to free software for up to twenty years.
de: Softwarepatente Die schlimmste Bedrohung mit der wir uns konfrontiert sehen stammt von Softwarepatenten, die für bis zu zwanzig Jahre Algorithmen und Funktionen für Freie Software tabu setzen können.

source: The LZW compression algorithm patents were applied for in 1983, and we still cannot release free software to produce proper compressed GIFs. [As of 2009 they have expired.] In 1998, a free program to produce MP3 compressed audio was removed from distribution under threat of a patent suit.
de: Die Patente für das LZW-Komprimierungsverfahren wurden 1983 beantragt, und wir können noch immer keine Freie Software freigeben, um ordnungsgemäß komprimierte GIF-Dateien (Graphics Interchange Format) zu erzeugen.(*) 1998 wurde ein freies Programm zur Produktion von komprimiertem MP3-Audio (MPEG-1 Audio Layer 3) unter Androhung einer Patentklage aus der Distribution herausgenommen.(**)

source: [As of 2017, these patents have expired. Look how long we had to wait.]
de: Es gibt Möglichkeiten, Patente zu bewältigen: man kann nach Beweisen suchen, ob ein Patent ungültig ist und nach alternativen Wegen suchen um eine Aufgabe zu lösen.

source: There are ways to cope with patents: we can search for evidence that a patent is invalid, and we can look for alternative ways to do a job.
de: Aber jede dieser Methoden funktioniert nur manchmal.

source: But each of these methods works only sometimes; when both fail, a patent may force all free software to lack some feature that users want.
de: schlagen beide fehl, kann ein Patent jegliche Freie Software dazu zwingen, dass eine Eigenschaft fehlt, die Benutzer wollen.

source: After a long wait, the patents expire (the MP3 patents are expected to have expired by 2018), but what will we do until then?
de: Nach einer langen Wartezeit erlöschen Patente (die MP3-Patente beispielsweise erlöschen voraussichtlich bis 2018), aber was machen wir bis dahin?

source: Those of us who value free software for freedom's sake will stay with free software anyway.
de: Diejenigen von uns, die freie Software der Freiheit wegen schätzen, bleiben sowieso bei freier Software.

source: We will manage to get work done without the patented features.
de: Wir schaffen es, Aufgaben ohne patentierte Funktionen zu erledigen.

source: But those who value free software because they expect it to be technically superior are likely to call it a failure when a patent holds it back.
de: Aber diejenigen, die freie Software schätzen, weil sie sie als technisch überlegen erwarten, werden es wahrscheinlich einen Misserfolg nennen, wenn ein Patent davon abhält.

source: Thus, while it is useful to talk about the practical effectiveness of the “bazaar” model of development, and the reliability and power of some free software, we must not stop there.
de: Daher, obwohl es sinnvoll ist, über die praktische Wirksamkeit des Bazaar-Entwicklungsmodells sowie der Zuverlässigkeit und Macht irgendeiner freien Software zu sprechen, dürfen wir dort nicht anhalten.

source: We must talk about freedom and principle.
de: Wir müssen über Freiheit und Prinzipien sprechen.

source: Free documentation The biggest deficiency in our free operating systems is not in the software—it is the lack of good free manuals that we can include in our systems.
de: Freie Dokumentation Der größte Mangel an unseren freien Betriebssystemen ist nicht die Software ‑ es ist der Mangel an guten freien Handbüchern, die wir in unsere Systeme integrieren können.

source: Documentation is an essential part of any software package; when an important free software package does not come with a good free manual, that is a major gap.
de: Dokumentation ist ein wesentlicher Bestandteil jedes Softwarepakets; wenn ein wichtiges freies Softwarepaket nicht mit einem guten freien Handbuch erhältlich ist, ist das eine große Lücke.

source: We have many such gaps today.
de: Wir haben heute viele solcher Lücken.

source: Free documentation, like free software, is a matter of freedom, not price.
de: Freie Dokumentation, wie freie Software, ist eine Frage der Freiheit, nicht des Preises.

source: The criterion for a free manual is pretty much the same as for free software: it is a matter of giving all users certain freedoms.
de: Das Kriterium eines freien Handbuchs ist dem freier Software ziemlich ähnlich: es geht darum, allen Benutzern bestimmte Freiheiten zu gewähren.

source: Redistribution (including commercial sale) must be permitted, online and on paper, so that the manual can accompany every copy of the program.
de: Weitervertrieb (einschließlich kommerziellen Verkaufs) muss online und auf Papier erlaubt sein, damit das Handbuch jede Programmkopie begleiten kann.

source: Permission for modification is crucial too.
de: Die Berechtigung zur Modifikation ist ebenfalls von entscheidender Bedeutung.

source: As a general rule, I don't believe that it is essential for people to have permission to modify all sorts of articles and books.
de: Im Allgemeinen glaube ich nicht, dass die Berechtigung notwendig ist, alle möglichen Artikel und Bücher modifizieren zu dürfen.

source: For example, I don't think you or I are obliged to give permission to modify articles like this one, which describe our actions and our views.
de: Beispielsweise denke ich nicht, dass Sie oder ich verpflichtet sind die Berechtigung zu erteilen, Artikel wie diesen zu modifizieren, der unsere Handlungen und Ansichten beschreibt.

source: But there is a particular reason why the freedom to modify is crucial for documentation for free software.
de: Es gibt aber einen bestimmten Grund, warum die Freiheit zur Modifizierung für Dokumentation von freier Software entscheidend ist.

source: When people exercise their right to modify the software, and add or change its features, if they are conscientious they will change the manual, too—so they can provide accurate and usable documentation with the modified program.
de: Wenn die Menschen ihr Recht ausüben, Software zu modifizieren und Funktionen zu ändern oder hinzuzufügen, wenn sie gewissenhaft sind, ändern sie das Handbuch auch ‑ damit eine genaue und nutzbare Dokumentation mit dem modifizierten Programm angeboten werden kann.

source: A nonfree manual, which does not allow programmers to be conscientious and finish the job, does not fill our community's needs.
de: Ein unfreies Handbuch, dass gewissenhaften Programmierern nicht erlaubt die Aufgabe zu beenden, erfüllt nicht den Bedarf unserer Gemeinschaft.

source: Some kinds of limits on how modifications are done pose no problem.
de: Einige Einschränkungen, wie Modifikationen vorgenommen werden können, werfen keine Probleme auf.

source: For example, requirements to preserve the original author's copyright notice, the distribution terms, or the list of authors, are OK.
de: Beispielsweise sind Anforderungen, den Copyright-Hinweis des Originalautors, die Vertriebsbedingungen oder die Autorenliste anzugeben, in Ordnung.

source: It is also no problem to require modified versions to include notice that they were modified, even to have entire sections that may not be deleted or changed, as long as these sections deal with nontechnical topics.
de: Es ist auch kein Problem zu verlangen, dass modifizierte Versionen einen Hinweis enthalten, dass sie modifiziert wurden, ebenso wie ganze Abschnitte vor dem Löschen oder Verändern zu schützen, solange diese Abschnitte nichttechnische Themen behandeln.

source: These kinds of restrictions are not a problem because they don't stop the conscientious programmer from adapting the manual to fit the modified program.
de: Diese Beschränkungen sind kein Problem, weil sie den gewissenhaften Programmierer nicht davon abhalten, das Handbuch dem modifizierten Programm anzupassen.

source: In other words, they don't block the free software community from making full use of the manual.
de: Mit anderen Worten halten sie die Freie-Software-Gemeinschaft nicht davon ab, vollen Gebrauch vom Handbuch zu machen.

source: However, it must be possible to modify all the technical content of the manual, and then distribute the result in all the usual media, through all the usual channels; otherwise, the restrictions do obstruct the community, the manual is not free, and we need another manual.
de: Jedoch muss es möglich sein, den ganzen technischen Inhalt des Handbuchs zu modifizieren und das Ergebnis mit allen gängigen Medien und üblichen Kanälen zu verbreiten; andernfalls behindern die Beschränkungen die Gemeinschaft, das Handbuch ist unfrei und wir brauchen ein anderes.

source: Will free software developers have the awareness and determination to produce a full spectrum of free manuals?
de: Haben Freie-Software-Entwickler das Bewusstsein und die Entschlossenheit, ein breites Spektrum von freien Handbüchern zu schreiben?

source: Once again, our future depends on philosophy.
de: Noch einmal hängt unsere Zukunft von Philosophie ab.

source: We must talk about freedom Estimates today are that there are ten million users of GNU/Linux systems such as Debian GNU/Linux and Red Hat “Linux”.
de: Wir müssen über Freiheit sprechen Nach heutigen Schätzungen gibt es zehn Millionen Nutzer von GNU/Linux-Systemen wie Debian GNU/Linux und Red Hat „Linux“.

source: Free software has developed such practical advantages that users are flocking to it for purely practical reasons.
de: Freie Software hat solche praktische Vorteile entwickelt, dass Nutzer aus rein praktischen Erwägungen zuströmen.

source: The good consequences of this are evident: more interest in developing free software, more customers for free software businesses, and more ability to encourage companies to develop commercial free software instead of proprietary software products.
de: Die guten Konsequenzen daraus sind offensichtlich: mehr Interesse an der Entwicklung freier Software, mehr Kunden für Geschäfte mit freier Software und mehr Möglichkeiten, Unternehmen zu ermutigen, kommerzielle freie Software anstelle proprietärer Softwareprodukte zu entwickeln.

source: But interest in the software is growing faster than awareness of the philosophy it is based on, and this leads to trouble.
de: Aber das Interesse an der Software wächst schneller als das Bewusstsein der Philosophie, auf der sie basiert, und das führt zu Problemen.

source: Our ability to meet the challenges and threats described above depends on the will to stand firm for freedom.
de: Unsere Möglichkeiten, den o. a. Herausforderungen und Bedrohungen zu entsprechen, hängt vom Willen ab, eine feste Haltung für Freiheit einzunehmen.

source: To make sure our community has this will, we need to spread the idea to the new users as they come into the community.
de: Um sicherzugehen, dass unsere Gemeinschaft diesen Willen hat, müssen wir den Gedanken an neue Nutzer verbreiten, wenn sie in die Gemeinschaft kommen.

source: But we are failing to do so: the efforts to attract new users into our community are far outstripping the efforts to teach them the civics of our community.
de: Aber wir versagen dabei: die Bemühungen, neue Benutzer für unsere Gemeinschaft zu gewinnen, übersteigen bei weitem die Bemühungen, ihnen die Pflichten unserer Gemeinschaft zu lehren.

source: We need to do both, and we need to keep the two efforts in balance.
de: Wir müssen beides machen, und wir müssen beide Bemühungen im Gleichgewicht halten.

source: “Open Source” Teaching new users about freedom became more difficult in 1998, when a part of the community decided to stop using the term “free software” and say “open source software” instead.
de: „Open Source“ Neuen Benutzern etwas über Freiheit zu lehren wurde 1998 schwieriger, als ein Teil der Gemeinschaft beschloss, nicht mehr den Begriff Freie Software zu verwenden, sondern stattdessen „Open-Source“-Software.

source: Some who favored this term aimed to avoid the confusion of “free” with “gratis”—a valid goal.
de: Einige, die diesen Begriff bevorzugten, hatten zum Ziel, die Verwechslung von frei mit gratis zu vermeiden ‑ ein zulässiges Ziel.

source: Others, however, aimed to set aside the spirit of principle that had motivated the free software movement and the GNU Project, and to appeal instead to executives and business users, many of whom hold an ideology that places profit above freedom, above community, above principle.
de: Andere hatten jedoch zum Ziel, den Geist des Prinzips ins Abseits zu drängen, der die Freie-Software-Bewegung und das GNU-Projekt motivierte, und stattdessen an Führungskräfte und Geschäftskunden zu appellieren, von denen viele eine Ideologie haben, die Gewinn über Freiheit, über Gemeinschaft und über Prinzipien stellt.

source: Thus, the rhetoric of “open source” focuses on the potential to make high-quality, powerful software, but shuns the ideas of freedom, community, and principle.
de: So konzentriert sich die Rhetorik von „Open Source“ auf das Potenzial, qualitativ hochwertige und leistungsfähige Software herzustellen, aber die Ideen von Freiheit, Gemeinschaft und Prinzip meidet.

source: The “Linux” magazines are a clear example of this—they are filled with advertisements for proprietary software that works with GNU/Linux.
de: Die „Linux“-Fachzeitschriften sind ein eindeutiges Beispiel dafür ‑ sie sind mit Werbung für proprietäre Software gefüllt, die mit GNU/Linux funktioniert.

source: When the next Motif or Qt appears, will these magazines warn programmers to stay away from it, or will they run ads for it?
de: Wenn das nächste Motif oder Qt erscheint, werden diese Magazine Programmierer warnen sich davon fernzuhalten oder werden sie dafür werben?

source: The support of business can contribute to the community in many ways; all else being equal, it is useful.
de: Die Unterstützung des Geschäfts kann in vielerlei Hinsicht zur Gemeinschaft beitragen; unter sonst gleichen Bedingungen ‚Ceteris Paribus‘ ist es nützlich.

source: But winning their support by speaking even less about freedom and principle can be disastrous; it makes the previous imbalance between outreach and civics education even worse.
de: Aber ihre Unterstützung zu gewinnen, indem man noch weniger über Freiheit und Prinzipien spricht, kann katastrophal sein; es macht das vorherige Ungleichgewicht zwischen sozialem Engagement und politischer Bildung noch schlimmer.

source: “Free software” and “open source” describe the same category of software, more or less, but say different things about the software, and about values.
de: Freie Software und Open Source beschreiben mehr oder weniger die gleiche Softwarekategorie, aber sagen verschiedene Dinge über Software und Werte.

source: The GNU Project continues to use the term “free software”, to express the idea that freedom, not just technology, is important.
de: Das GNU-Projekt verwendet weiterhin den Begriff Freie Software um die Idee zum Ausdruck zu bringen, dass Freiheit, nicht nur Technik, wichtig ist.

source: Try!
de: Testen Sie!

source: Yoda's aphorism (“There is no ‘try’”) sounds neat, but it doesn't work for me.
de: Yodas Aphorismus (Es gibt kein Versuchen) klingt nett, aber funktioniert nicht für mich.

source: I have done most of my work while anxious about whether I could do the job, and unsure that it would be enough to achieve the goal if I did.
de: Ich habe die meisten meiner Aufgaben geleistet, während ich besorgt war, ob ich sie erledigen kann und unsicher war, ob es ausreichen würde um das Ziel zu erreichen.

source: But I tried anyway, because there was no one but me between the enemy and my city.
de: Aber ich versuchte es trotzdem, denn es gab niemand außer mir zwischen dem Feind und meiner Stadt.

source: Surprising myself, I have sometimes succeeded.
de: Selbst überrascht, ist es manchmal gelungen.

source: Sometimes I failed; some of my cities have fallen.
de: Manchmal habe ich versagt; einige meiner Städte sind gefallen.

source: Then I found another threatened city, and got ready for another battle.
de: Dann fand ich eine andere bedrohte Stadt und machte mich für eine andere Schlacht bereit.

source: Over time, I've learned to look for threats and put myself between them and my city, calling on other hackers to come and join me.
de: Im Laufe der Zeit habe ich gelernt, nach Bedrohungen Ausschau zu halten und mich selbst zwischen sie und meine Stadt zu stellen, und rief andere Hacker auf, zu kommen und sich mir anzuschließen.

source: Nowadays, often I'm not the only one.
de: Heutzutage bin ich oft nicht der einzige.

source: It is a relief and a joy when I see a regiment of hackers digging in to hold the line, and I realize, this city may survive—for now.
de: Es ist eine Erleichterung und Freude, wenn ich sehe wie sich ein Regiment von Hackern eingräbt, um die Stellung zu halten, und weiß, diese Stadt kann überleben ‑ im Moment.

source: But the dangers are greater each year, and now Microsoft has explicitly targeted our community.
de: Aber die Gefahren werden jedes Jahr größer, und nun hat sich Microsoft klar gegen unsere Gemeinschaft ausgerichtet.

source: We can't take the future of freedom for granted.
de: Wir können die zukünftige Freiheit nicht für selbstverständlich halten.

source: Don't take it for granted!
de: Halten Sie sie nicht für selbstverständlich!

source: If you want to keep your freedom, you must be prepared to defend it.
de: Wenn Sie Ihre Freiheit behalten möchten, müssen Sie bereit sein sie zu verteidigen.

source: The GNU Manifesto The GNU Manifesto (which appears below) was written by Richard Stallman in 1985 to ask for support in developing the GNU operating system.
de: GNU-Manifest Das nachstehende GNU-Manifest wurde von Richard Stallman 1985 geschrieben, um um Unterstützung bei der Entwicklung des Betriebssystems GNU zu bitten.

source: Part of the text was taken from the original announcement of 1983. Through 1987, it was updated in minor ways to account for developments; since then, it seems best to leave it unchanged.
de: Ein Teil des Textes stammt aus der ursprünglichen Ankündigung von 1983 und wurde bis 1987 geringfügig angepasst, um neue Entwicklungen zu berücksichtigen; seither scheint es am besten, den Text unverändert zu belassen.

source: Since that time, we have learned about certain common misunderstandings that different wording could help avoid.
de: Seit dieser Zeit haben wir von einigen häufigen Missverständnissen erfahren, die durch eine andere Wortwahl hätten vermieden werden können.

source: Footnotes added since 1993 help clarify these points.
de: Seit 1993 hinzugefügte Kommentare helfen diese Punkte zu klären.

source: If you want to install the GNU/Linux system, we recommend you use one of the 100% free software GNU/Linux distributions.
de: Wenn Sie das GNU-System installieren möchten, empfehlen wir, dass Sie eines der 100%ig Freie-Software-Distributionen von GNU/Linux verwenden.

source: For how to contribute, see http://www.gnu.org/help.
de: Weitere Informationen, wie man zu GNU beitragen kann, siehe http://www.gnu.org/help/.

source: The GNU Project is part of the Free Software Movement, a campaign for freedom for users of software.
de: Das GNU-Projekt ist Teil der Freie-Software-Bewegung, einer Kampagne für Freiheit für die Nutzer von Software.

source: It is a mistake to associate GNU with the term “open source”—that term was coined in 1998 by people who disagree with the Free Software Movement's ethical values.
de: Es handelt sich daher um einen Fehler, GNU mit dem Begriff „Open Source“ zu assoziieren ‑ dieser Begriff wurde bereits 1998 von Personen geprägt, die mit den ethischen Werten der Freie-Software-Bewegung nicht übereinstimmten.

source: They use it to promote an amoral approach to the same field.
de: Sie gebrauchten ihn, um einen unmoralischen Ansatz auf dem gleichen Gebiet zu fördern.

source: What's GNU?
de: Was ist GNU?

source: Gnu's Not Unix!
de: Gnu ist Nicht Unix!

source: GNU, which stands for Gnu's Not Unix, is the name for the complete Unix-compatible software system which I am writing so that I can give it away free to everyone who can use it.(1) Several other volunteers are helping me.
de: GNU, was für Gnu's Not Unix (‚Gnu ist Nicht Unix‘) steht, ist der Name für das vollständig unixoide Softwaresystem, das ich schreibe, um es frei an jedermann wegzugeben, der es nutzen kann.(1) Einige andere Freiwillige unterstützen mich.

source: Contributions of time, money, programs and equipment are greatly needed.
de: Beiträge in Form von Zeit, Geld, Programmen und Ausstattung werden dringend benötigt.

source: So far we have an Emacs text editor with Lisp for writing editor commands, a source level debugger, a yacc-compatible parser generator, a linker, and around 35 utilities.
de: Bis jetzt haben wir einen Emacs-Texteditor nebst Lisp zum Schreiben von Editorbefehlen, einen Quelltextdebugger, einen Yacc-kompatiblen Parsergenerator, einen Linker und etwa 35 Dienstprogramme.

source: A shell (command interpreter) is nearly completed.
de: Ein Kommandozeileninterpreter ist beinahe fertig.

source: A new portable optimizing C compiler has compiled itself and may be released this year.
de: Ein neuer portabler, optimierender C-Compiler hat sich aus seinem eigenen Quellcode kompiliert und kann dieses Jahr freigegeben werden.
